In [32]:
import numpy as np
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

In [33]:
pd.read_csv(r'C:\Users\ACER\Downloads\Trent_10yrs\Quote-Equity-TRENT-EQ-13-06-2015-to-13-06-2016.csv').shape

(246, 14)

In [34]:
import glob

In [35]:
df = pd.concat(map(pd.read_csv, glob.glob(r'C:\Users\ACER\Downloads\Trent_10yrs\Quote-Equity-TRENT-EQ-*.csv')))

In [36]:
df.shape

(2498, 14)

In [37]:
df.head()

,Date,series,OPEN,HIGH,LOW,PREV. CLOSE,ltp,close,vwap,52W H,52W L,VOLUME,VALUE,No of trades
0,13-Jun-2016,EQ,"1,697.95","1,720.00","1,680.00","1,688.15","1,680.00","1,693.65","1,702.07","1,879.00","1,105.70","3,853","65,58,083.40",517
1,10-Jun-2016,EQ,"1,700.50","1,710.00","1,680.00","1,697.40","1,687.00","1,688.15","1,701.44","1,879.00","1,105.70","2,052","34,91,360.15",418
2,09-Jun-2016,EQ,"1,725.00","1,725.00","1,690.00","1,691.20","1,702.90","1,697.40","1,695.50","1,879.00","1,105.70","3,838","65,07,336.95",419
3,08-Jun-2016,EQ,"1,725.00","1,725.00","1,685.40","1,704.50","1,690.00","1,691.20","1,697.02","1,879.00","1,105.70",659,"11,18,335.05",227
4,07-Jun-2016,EQ,"1,690.00","1,723.00","1,679.95","1,689.25","1,700.00","1,704.50","1,692.15","1,879.00","1,105.70","26,248","4,44,15,473.00","1,055"

In [38]:
df.tail()

,Date,series,OPEN,HIGH,LOW,PREV. CLOSE,ltp,close,vwap,52W H,52W L,VOLUME,VALUE,No of trades
243,28-Jun-2024,EQ,"5,360.00","5,509.00","5,358.55","5,329.00","5,475.00","5,479.85","5,454.88","5,509.00","1,657.45","9,70,080","5,29,16,70,384.80","92,533"
244,27-Jun-2024,EQ,"5,360.00","5,387.00","5,303.75","5,363.80","5,340.00","5,329.00","5,328.72","5,459.00","1,657.45","9,00,729","4,79,97,33,989.65","78,549"
245,26-Jun-2024,EQ,"5,345.00","5,395.00","5,260.00","5,338.80","5,352.80","5,363.80","5,353.66","5,459.00","1,657.45","5,78,724","3,09,82,94,358.25","71,844"
246,25-Jun-2024,EQ,"5,440.50","5,459.00","5,304.05","5,395.75","5,330.00","5,338.80","5,362.07","5,459.00","1,657.45","5,59,045","2,99,76,37,495.40","69,492"
247,24-Jun-2024,EQ,"5,266.35","5,440.00","5,200.00","5,266.35","5,434.15","5,395.75","5,338.77","5,452.00","1,657.45","5,43,826","2,90,33,61,753.40","57,740"

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2498 entries, 0 to 247
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           2498 non-null   object
 1   series         2498 non-null   object
 2   OPEN           2498 non-null   object
 3   HIGH           2498 non-null   object
 4   LOW            2498 non-null   object
 5   PREV. CLOSE    2498 non-null   object
 6   ltp            2498 non-null   object
 7   close          2498 non-null   object
 8   vwap           2498 non-null   object
 9   52W H          2498 non-null   object
 10  52W L          2498 non-null   object
 11  VOLUME         2498 non-null   object
 12  VALUE          2498 non-null   object
 13  No of trades   2498 non-null   object
dtypes: object(14)
memory usage: 292.7+ KB

In [40]:
df.columns

Index(['Date ', 'series ', 'OPEN ', 'HIGH ', 'LOW ', 'PREV. CLOSE ', 'ltp ',
       'close ', 'vwap ', '52W H ', '52W L ', 'VOLUME ', 'VALUE ',
       'No of trades '],
      dtype='object')

In [41]:
df.columns = df.columns.str.strip()

In [42]:
df.columns

Index(['Date', 'series', 'OPEN', 'HIGH', 'LOW', 'PREV. CLOSE', 'ltp', 'close',
       'vwap', '52W H', '52W L', 'VOLUME', 'VALUE', 'No of trades'],
      dtype='object')

In [43]:
import datetime

df['Date'] = pd.to_datetime(df['Date'], format='%d-%b-%Y')

In [44]:
df.sort_values(by='Date', inplace=True)

In [45]:
df.reset_index(drop=True, inplace=True)

In [46]:
df.head()

,Date,series,OPEN,HIGH,LOW,PREV. CLOSE,ltp,close,vwap,52W H,52W L,VOLUME,VALUE,No of trades
0,2015-06-15,EQ,"1,137.55","1,152.80","1,112.15","1,144.00","1,120.05","1,123.75","1,128.35","1,596.00","1,095.00","3,287","37,08,872.35",621
1,2015-06-16,EQ,"1,134.95","1,135.95","1,105.70","1,123.75","1,117.00","1,118.80","1,118.12","1,596.00","1,095.00","1,908","21,33,380.10",235
2,2015-06-17,EQ,"1,139.95","1,213.00","1,122.00","1,118.80","1,210.00","1,198.30","1,173.44","1,596.00","1,095.00","13,670","1,60,40,968.25","1,591"
3,2015-06-18,EQ,"1,185.00","1,217.95","1,180.25","1,198.30","1,188.00","1,191.45","1,193.12","1,596.00","1,095.00","3,813","45,49,377.30",465
4,2015-06-19,EQ,"1,200.00","1,230.00","1,171.00","1,191.45","1,210.00","1,216.95","1,214.88","1,596.00","1,095.00","4,676","56,80,765.80",728

In [47]:
df.isnull().sum()

Date            0
series          0
OPEN            0
HIGH            0
LOW             0
PREV. CLOSE     0
ltp             0
close           0
vwap            0
52W H           0
52W L           0
VOLUME          0
VALUE           0
No of trades    0
dtype: int64

In [48]:
df['Date'].iloc[-1] - df['Date'].iloc[0]

Timedelta('3658 days 00:00:00')